package com.hy.demo02Instance;

/*
    Java语言是一种面向对象的程序设计语言，而面向对象思想是一种程序设计思想，我们在面向对象思想的指引下，
使用Java语言去设计、开发计算机程序。这里的对象泛指现实中一切事物，每种事物都具备自己的属性和行为。
面向对象的思想就是在计算机程序设计过程中，参照现实中的事物，将事物的属性特征、行为特征抽象出来，
描述成计算机事件的设计思想。他区别于面向过程思想，强调的是通过调用对象的行为来实现功能，而不是自己一步一步的
去操作实现

类：是一组相关属性和行为的集合，可以看成是一类事物的模板，使用事物的属性特征和行为特征来描述该类事物
属性：该事物的状态信息
行为：就是该事物能够做什么

对象：是一类事物的具体实现。对象是类的一个实例，必然具备该类事物的属性和行为

类与对象的关系：
类是对一类事物的描述，是抽象的
对象是一类事物的实例，是具体的
类是对象的模板，对象是类的实体

封装：
    面向对象编程语言是对客观世界的模拟，客观世界里成员变量都是隐藏在对象内部的，外界无法直接操作和修改。
    封装可以被认为是一个保护屏障，防止该类的代码和数据被其他类随意访问。要访问该类的数据，必须通过指定的
    方式。适当的封装可以让代码更容易理解与维护，也加强了代码的安全性
原则：
    将属性隐藏起来，若需要访问某个属性，提供公共方法对其访问
步骤：
    1.使用private关键字来修饰成员变量
    2.对需要访问的成员变量，提供对象的一对getXxx、setXxx方法
private关键字：

this关键字：
    this代表所在类的当前对象的引用（地址值），即对象自己的引用
构造方法：

JavaBean:
    是Java语言编写类的一种标准规范，符合JavaBean的类，要求类笔试是具体的和公共的，并且具有无参数的构造方法，
    提供用来操作成员变量的set和get方法。
 */
public class Oop {
}
